tools/loadtest/gotling/templates/rehabstod/ListActiveSickLeavesForCareUnitRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:riv:itintegration:registry:1" xmlns:urn1="urn:riv:clinicalprocess:healthcond:rehabilitation:ListActiveSickLeavesForCareUnitResponder:1" xmlns:urn2="urn:riv:clinicalprocess:healthcond:certificate:types:2">
  <soapenv:Header>
    <urn:LogicalAddress>spelar-ingen-roll</urn:LogicalAddress>
  </soapenv:Header>
  <soapenv:Body>
    <urn1:ListActiveSickLeavesForCareUnit>
      <urn1:enhets-id>
        <urn2:root>1.2.752.129.2.1.4.1</urn2:root>
        <urn2:extension>${careUnitHsaId}</urn2:extension>
      </urn1:enhets-id>
      <!--You may enter ANY elements at this point-->
    </urn1:ListActiveSickLeavesForCareUnit>
  </soapenv:Body>
</soapenv:Envelope>
